{
  "backend/main.mo": "Main backend actor defining data models, maps, authorization setup, and state for agents, users, customers, leads, messages, and logs.",
  "backend/migration.mo": "Migration module transforming old agent profiles to new ones by resetting status to pending during upgrade.",
  "feature_evidence.json": "Feature evidence report detailing frontend changes required to surface backend fetch errors in admin agent approval views.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and changes of various frontend components and hooks.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/PRODUCTION_DEPLOYMENT_LOGS.md": "Template for recording deployment steps, outputs, and verification details for production releases.",
  "frontend/PRODUCTION_STABILIZATION.md": "Documentation outlining production issues, root causes, and stabilization changes across versions 14–16.",
  "frontend/scripts/deploy-mainnet-version16.md": "Runbook with procedural steps and checklists for deploying Version 16 to mainnet.",
  "frontend/src/App.tsx": "Main React component handling authentication flow, startup guards, lazy-loaded dashboards, and global layout.",
  "frontend/src/components/AdminAddCustomerDialog.tsx": "Dialog component for admins to add a new customer with validation and form fields, submitting via useAddCustomer. Filters approved agents and resets state after successful submission.",
  "frontend/src/components/AdminAddLeadDialog.tsx": "Dialog form for creating a new lead with validation, status and requirement selection, and assigned agent. Submits via useAddLead and resets fields on success.",
  "frontend/src/components/AdminCustomersList.tsx": "Displays a filterable list of customers with call and WhatsApp actions and supports admin creation of new customers. Fetches customers and agents, showing loading and empty states.",
  "frontend/src/components/AdminFollowUpsList.tsx": "Lists all follow-ups with agent filtering, overdue detection, and access to linked customer or lead details. Handles loading and empty states and provides call/WhatsApp actions.",
  "frontend/src/components/AdminInvoicePanel.tsx": "UI for generating and sending invoices via WhatsApp to customers or leads. Includes a dialog with form fields and uses local state to manage invoice details.",
  "frontend/src/components/AdminLeadsList.tsx": "Displays and filters all leads for admins with agent/status filters, overdue detection, WhatsApp/Call shortcuts, and CSV export.",
  "frontend/src/components/AdminOverviewPanel.tsx": "Shows admin-level summary stats for agents and leads with navigation to filtered views and basic contact actions.",
  "frontend/src/components/AdminWhatsAppPanel.tsx": "Provides a communication hub showing customers and leads by agent with WhatsApp and call actions plus simple contact stats.",
  "frontend/src/components/AgentCustomersList.tsx": "Lets agents view and manage their customers, add new entries, and contact them via WhatsApp or phone.",
  "frontend/src/components/AgentFollowUpsList.tsx": "Allows agents to list, add, and track follow-ups for customers or leads with overdue detection and contact actions.",
  "frontend/src/components/AgentLeadsList.tsx": "Displays an agent’s leads, allows adding new leads, and includes WhatsApp/call actions with overdue detection.",
  "frontend/src/components/AgentWhatsAppPanel.tsx": "Shows customers and leads in tabs with WhatsApp/call actions and random contact stats.",
  "frontend/src/components/ApprovedAgentsList.tsx": "Lists approved agents with login status and exports their data to CSV.",
  "frontend/src/components/CameraCapture.tsx": "Provides a dialog-based camera interface to capture face images with support/error handling.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays site header with branding and login/logout via Internet Identity.",
  "frontend/src/components/LoginForm.tsx": "Handles agent login with mandatory face capture and error-based toast feedback.",
  "frontend/src/components/PendingAgentsList.tsx": "Displays pending agent registrations with approve/reject actions and handles loading, errors, and image previews.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for users to submit name, mobile, and email, saving the profile via mutation.",
  "frontend/src/components/RegisterForm.tsx": "Agent registration form that captures user details and a face image before submitting to the backend.",
  "frontend/src/components/StartupGate.tsx": "Wrapper that shows loading or error UI before rendering children based on startup state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useActorStable.ts": "Stable actor hook that initializes the backend actor with performance markers and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and authentication status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, agent approval flows, and related mutations.",
  "frontend/src/hooks/useStartupGuards.ts": "Combines identity, user profile, and admin status queries to provide startup loading, error, and retry state.",
  "frontend/src/index.css": "Defines Tailwind layers and color variables for light and dark themes with global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements an admin dashboard with tabbed panels loaded lazily for managing agents, customers, leads, and other resources.",
  "frontend/src/pages/AgentDashboard.tsx": "Renders the agent dashboard with approval checks, profile loading, error handling, and lazy-loaded tab panels.",
  "frontend/src/pages/AuthPage.tsx": "Provides a registration and login interface using tabbed forms within a styled card layout.",
  "frontend/src/types/index.ts": "Defines frontend types for users, agents, customers, leads, and follow-ups, mirroring backend structures.",
  "frontend/src/utils/approvalStatus.ts": "Normalizes backend approval status values and provides helper checks for pending, approved, or rejected states.",
  "frontend/src/utils/csv.ts": "Offers CSV escaping, conversion, downloading, and filename generation utilities.",
  "frontend/src/utils/startupPerf.ts": "Provides development-only utilities for measuring performance timing during startup.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with session storage support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot describing CRM requirements, architecture notes, known issues, and implemented features for Admin/Agent workflows."
}