{
  "backend/main.mo": "Motoko backend canister defining core CRM domain models (agents, users, customers, leads, follow-ups, chats, calls) with in-memory Maps, plus authorization, user approval, admin setup, and helper utilities for agent identity and activity tracking.",
  "feature_evidence.json": "Structured feature evidence report linking production deployment and verification features to files, components, test IDs, and confidence levels for Version 16.",
  "frontend-file-summaries.txt": "Aggregated human-written summaries of frontend source files describing each component’s purpose, behavior, and recent performance or UX optimizations.",
  "frontend/index.css": "Global Tailwind CSS base defining design tokens, OKLCH color variables, and light/dark theme styling for the entire frontend.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the React application via main.tsx with basic metadata.",
  "frontend/PRODUCTION_DEPLOYMENT_LOGS.md": "Template document for recording production deployment attempts, including commands used, timestamps, outputs, errors, and final canister IDs for Version 16.",
  "frontend/PRODUCTION_STABILIZATION.md": "Detailed postmortem and changelog describing production startup issues, root causes, and fixes across Versions 14–16, including lazy loading, query optimization, and production log stripping.",
  "frontend/scripts/deploy-mainnet-version16.md": "Step-by-step runbook and checklist for deploying Version 16 of the application to the Internet Computer mainnet.",
  "frontend/src/App.tsx": "Main React application component that handles authentication flow, conditional startup guards, lazy-loaded admin/agent dashboards, profile setup modal logic, and global layout.",
  "frontend/src/components/AdminAddCustomerDialog.tsx": "Modal dialog component that lets admins add a new customer with validation, assigning an approved agent, requirement type, and follow-up status, then submits via useAddCustomer.",
  "frontend/src/components/AdminAddLeadDialog.tsx": "Modal dialog for admins to create a new lead, capturing contact details, status, requirement, assigned agent, description, and remarks, and submitting through useAddLead with form validation.",
  "frontend/src/components/AdminCustomersList.tsx": "Admin-facing table view of all customers with filtering by assigned agent, actions to call or WhatsApp customers, and the ability for admins to open a dialog to add new customers.",
  "frontend/src/components/AdminFollowUpsList.tsx": "Displays all follow-ups in a table with agent filtering, overdue detection, links to customers or leads, and quick call/WhatsApp actions for admins.",
  "frontend/src/components/AdminInvoicePanel.tsx": "Invoice management panel that allows admins to generate a simple invoice for a customer or lead and send it via WhatsApp, using a dialog-based form.",
  "frontend/src/components/AdminLeadsList.tsx": "Admin table view for all leads with status and agent filters, overdue detection, WhatsApp/call actions, CSV export, and dialog to add new leads.",
  "frontend/src/components/AdminOverviewPanel.tsx": "Admin dashboard panel showing summary cards for agent approvals and lead statuses, with navigation callbacks and quick WhatsApp/call actions.",
  "frontend/src/components/AdminWhatsAppPanel.tsx": "Admin communication center to view customers and leads by agent and initiate WhatsApp messages or calls, with agent-based filtering.",
  "frontend/src/components/AgentCustomersList.tsx": "Agent-facing list of assigned customers with ability to add new customers, view requirements, and contact them via WhatsApp or phone.",
  "frontend/src/components/AgentFollowUpsList.tsx": "Agent interface to view and add follow-ups for customers or leads, track overdue items, and contact linked entities via WhatsApp or phone.",
  "frontend/src/components/AgentLeadsList.tsx": "Displays a table of leads assigned to the logged-in agent, with status/requirement labels, overdue detection, and WhatsApp/call actions. Includes a dialog form to add new leads via backend mutations.",
  "frontend/src/components/AgentWhatsAppPanel.tsx": "Provides a tabbed panel for agents to contact customers and leads via WhatsApp or phone, showing basic contact details and simulated communication stats. Fetches customers and leads for the logged-in agent and handles loading/empty states.",
  "frontend/src/components/ApprovedAgentsList.tsx": "Lists all approved agents with login status and last login time, combining agent profiles and login metadata. Supports exporting the approved agents list to CSV.",
  "frontend/src/components/CameraCapture.tsx": "Implements a modal camera interface for capturing a face photo using the device camera, with error handling and camera switching on mobile. Returns the captured image file to the parent component.",
  "frontend/src/components/Footer.tsx": "Renders a simple application footer with branding, year, and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Shows the app header with branding and a login/logout button backed by Internet Identity authentication. Handles login state, loading indicator, and query cache clearing on logout.",
  "frontend/src/components/LoginForm.tsx": "Implements agent login with mandatory face verification, integrating camera capture and backend login mutation. Handles success and detailed error cases with toast notifications.",
  "frontend/src/components/PendingAgentsList.tsx": "Displays a list of pending agent registrations, showing profile details and face images, with approve/reject actions and loading/error states.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces users to complete and save their basic profile (name, mobile, email) before continuing.",
  "frontend/src/components/RegisterForm.tsx": "Agent registration form that collects personal details, requires face capture via camera, and submits data for admin approval with toast feedback.",
  "frontend/src/components/StartupGate.tsx": "Wrapper component that handles startup loading and error states, showing a spinner or retryable error alert before rendering children.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useActorStable.ts": "Stable variant of the actor hook that delays initialization until identity is ready, tracks performance, and exposes loading/error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, agent approval status, and agent/lead data mutations using the backend actor.",
  "frontend/src/hooks/useStartupGuards.ts": "Custom React hook that coordinates startup queries for user profile and admin status, exposing combined loading, error, fetched state, and a retry method that selectively invalidates critical queries.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining base, components, and utilities, plus CSS variables for light/dark themes, colors, radius, charts, and default body/border styles.",
  "frontend/src/main.tsx": "Application entry point that creates a React root and wraps the App with React Query and Internet Identity providers, and imports global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabbed navigation and lazy-loaded panels for managing agents, customers, leads, follow-ups, WhatsApp, and invoices to optimize initial load.",
  "frontend/src/pages/AgentDashboard.tsx": "Agent dashboard page that uses startup guards and approval checks to conditionally render loading, error, pending approval, login, or a tabbed agent workspace with lazy-loaded panels.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page that presents register and login forms within a tabbed card layout, including branding and introductory text.",
  "frontend/src/types/index.ts": "Local TypeScript type definitions mirroring backend models, including user profiles, agents, customers, leads, follow-ups, and re-exported backend enums.",
  "frontend/src/utils/approvalStatus.ts": "Utility functions to normalize backend approval status formats and provide helpers to check pending, approved, or rejected states.",
  "frontend/src/utils/csv.ts": "CSV export utilities that escape fields per RFC4180, convert object arrays to CSV, trigger browser downloads, and generate date-based filenames.",
  "frontend/src/utils/startupPerf.ts": "Development-only performance instrumentation helpers for marking, measuring, and logging synchronous and asynchronous startup timings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query strings or hash routing, persisting them in sessionStorage, and managing sensitive parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom container settings, extensive theme extensions using CSS variables (colors, radius, shadows), accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and evolving state for the “VR Homes Infra CRM,” outlining scope, versions, and a detailed list of implemented features such as RBAC, authentication flows, agent approval, dashboards, and core CRM modules."
}