{
  "kind": "build_request",
  "title": "Fix agent approval not appearing in Admin after agent registration",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Ensure that when an Agent registers, the registration is persisted in the backend in a way that makes the Agent immediately appear in the Admin pending-approval workflow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Agent approval is not showing after registration of agent."
        ]
      },
      "acceptanceCriteria": [
        "After a successful `registerAgent(...)` call, the registering Agent is visible to an Admin in the pending agents list without requiring any manual backend intervention.",
        "A newly registered Agent has an approval status of \"pending\" until explicitly approved or rejected by an Admin."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Make `getAllAgentProfiles()` return an approval `status` that is consistent with the approval system (UserApproval state), so Admin UI filtering (pending/approved/rejected) works reliably for every agent profile.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Agent approval is not showing after registration of agent."
        ]
      },
      "acceptanceCriteria": [
        "For every agent profile returned by `getAllAgentProfiles()`, the `status` field accurately reflects the current approval state (pending/approved/rejected).",
        "The Admin pending list (frontend `PendingAgentsList` filtering via `isPending(agent.status)`) includes newly registered agents whose approval is pending."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Ensure Admin approval actions update the same underlying agent approval state that is displayed in Admin lists, so approving/rejecting a pending agent immediately moves the agent between Pending and Approved views.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Agent approval is not showing after registration of agent."
        ]
      },
      "acceptanceCriteria": [
        "Calling backend `approveAgent(mobile)` causes the agent to disappear from the pending list and appear in the approved list on the next fetch/refetch.",
        "Calling backend `rejectAgent(mobile)` causes the agent to disappear from the pending list and be marked rejected in backend state.",
        "No mismatch exists between approval state used by `listApprovals()` and the `status` exposed on agent profiles used by Admin UI lists."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the frontend Admin agent approval views to clearly surface backend fetch errors (e.g., authorization or failed query) instead of silently showing an empty pending list, so admins can distinguish \"no pending agents\" from \"cannot load pending agents\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Agent approval is not showing after registration of agent."
        ]
      },
      "acceptanceCriteria": [
        "If `useGetAllAgentProfiles()` fails, the Admin pending agents panel shows an error state with a readable English message and a retry action (or guidance to re-login).",
        "If `useGetAllAgentProfiles()` succeeds and there are truly no pending agents, the UI continues to show: \"No pending agent registrations at this time.\""
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit any files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new modules or redesign the dashboards beyond what is required to fix the missing agent approval visibility.",
    "Do not introduce external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}