{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 16 production go-live readiness (frontend-side deployment docs + verification + startup stability)",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Prepare frontend-side production deployment guidance and readiness to support making Version 16 live on the production URL.",
      "acceptanceCriteria": [
        "Production deployment completes successfully without a deployment failure",
        "Backend canister is installed/upgraded successfully on mainnet",
        "Frontend canister is installed/upgraded successfully on mainnet",
        "The app is reachable on the production URL and loads without a prolonged blank/loading screen"
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_STABILIZATION.md",
          "operation": "modify",
          "description": "Update the document from Version 15 to Version 16 and add/refresh the production deployment section (mainnet deploy/upgrade steps, required prechecks, and post-deploy smoke checks focused on production URL reachability and avoiding prolonged blank/loading screens)."
        },
        {
          "path": "frontend/scripts/deploy-mainnet-version16.md",
          "operation": "create",
          "description": "Create a concise, reproducible mainnet deployment runbook for Version 16 that specifies the exact command patterns to deploy/upgrade canisters, how to confirm the production URL is serving the latest assets, and what to capture if retries are needed."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and harden production initial-load behavior so unauthenticated users render the Auth page immediately and authenticated users only see brief, lightweight loading indicators while dashboards lazy-load (no prolonged blank/loading screen)."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Ensure the production verification checklist is current and the app startup flow meets the checklist expectations (unauthenticated fast Auth render, post-login lightweight startup, no unexpected production console errors).",
      "acceptanceCriteria": [
        "Unauthenticated users see the Auth page immediately (no prolonged loading screen)",
        "Post-login transitions to the correct dashboard with only brief, lightweight loading indicators",
        "No unexpected console errors appear in a production build during normal navigation"
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_STABILIZATION.md",
          "operation": "modify",
          "description": "Refresh and reorder the verification checklist to match Version 16 behavior, explicitly covering unauthenticated initial-load, post-login startup, and normal navigation checks, including what to observe in the browser console in a production build."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Configure React Query production-friendly defaults (to reduce startup query churn and refetch storms) and add production-safe console suppression for non-essential logs so production builds do not emit unexpected console output during normal navigation."
        },
        {
          "path": "frontend/src/hooks/useActorStable.ts",
          "operation": "modify",
          "description": "Confirm actor initialization remains resilient and non-blocking for unauthenticated sessions, and ensure authenticated initialization failures surface as actionable errors with minimal retries to avoid prolonged startup loading in production."
        },
        {
          "path": "frontend/src/hooks/useStartupGuards.ts",
          "operation": "modify",
          "description": "Verify startup guards remain conditionally enabled only when authenticated, and that retry behavior invalidates only the necessary startup queries to keep post-login transitions lightweight."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Provide a Version 16 production deployment logging template to capture commands, full output/error logs, and final canister IDs when deployment fails or requires retries.",
      "acceptanceCriteria": [
        "`frontend/PRODUCTION_DEPLOYMENT_LOGS.md` includes the exact production deploy command used",
        "`frontend/PRODUCTION_DEPLOYMENT_LOGS.md` includes full deploy output/error logs (when applicable)",
        "`frontend/PRODUCTION_DEPLOYMENT_LOGS.md` lists the final Backend Canister ID and Frontend Canister ID used for production"
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_DEPLOYMENT_LOGS.md",
          "operation": "modify",
          "description": "Update the template from Version 15 to Version 16 and restructure it to explicitly capture (1) the exact deploy command used, (2) full deploy output/error logs (including retries), and (3) final Backend/Frontend canister IDs and production URL verification notes."
        },
        {
          "path": "frontend/PRODUCTION_STABILIZATION.md",
          "operation": "modify",
          "description": "Add a short cross-reference section pointing to `frontend/PRODUCTION_DEPLOYMENT_LOGS.md` and enumerating what must be recorded whenever a deploy step fails or needs retries."
        }
      ]
    }
  ]
}